cmsis-svd/cmsis-svd/data/Microchip/ATSAM4LS.svd
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CONFW%s</name>
          <description>Window configuration Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WIS</name>
              <description>Window Mode Interrupt Settings</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>WEVSRC</name>
              <description>Peripheral Event Sourse Selection for Window Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>WEVEN</name>
              <description>Window Peripheral Event Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WFEN</name>
              <description>Window Mode Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CONF%s</name>
          <description>AC Configuration Register</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IS</name>
              <description>Interupt Settings</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Analog Comparator Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INSELN</name>
              <description>Negative Input Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EVENN</name>
              <description>Peripheral Event Enable Negative</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVENP</name>
              <description>Peripheral Event Enable Positive</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HYS</name>
              <description>Hysteresis Voltage Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FAST</name>
              <description>Fast Mode Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALWAYSON</name>
              <description>Always On</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADCIFE</name>
      <version>1.0.0</version>
      <description>ADC controller interface</description>
      <groupName>ADCIFE</groupName>
      <prependToName>ADCIFE_</prependToName>
      <baseAddress>0x40038000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADCIFE_INTREQ</name>
        <value>69</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TSTOP</name>
              <description>Internal timer stop bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TSTART</name>
              <description>Internal timer start bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STRIG</name>
              <description>Sequencer trigger</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>REFBUFEN</name>
              <description>Reference buffer enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>REFBUFDIS</name>
              <description>Reference buffer disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EN</name>
              <description>ADCIFD enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DIS</name>
              <description>ADCIFD disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BGREQEN</name>
              <description>Bandgap buffer request enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BGREQDIS</name>
              <description>Bandgap buffer request disable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Configuration Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REFSEL</name>
              <description>ADC Reference Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPEED</name>
              <description>ADC current reduction</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>Clock Selection for sequencer/ADC cell</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRESCAL</name>
              <description>Prescaler Rate Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SEOC</name>
              <description>Sequencer end of conversion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOVR</name>
              <description>Sequencer last converted value overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WM</name>
              <description>Window monitor</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SMTRG</name>
              <description>Sequencer missed trigger event</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUTD</name>
              <description>Start-up time done</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TTO</name>
              <description>Timer time-out</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EN</name>
              <description>Enable Status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TBUSY</name>
              <description>Timer busy</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SBUSY</name>
              <description>Sequencer busy</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CBUSY</name>
              <description>Conversion busy</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REFBUF</name>
              <description>Reference buffer status</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR</name>
          <description>Status Clear Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SEOC</name>
              <description>Sequencer end of conversion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LOVR</name>
              <description>Sequencer last converted value overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WM</name>
              <description>Window monitor</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SMTRG</name>
              <description>Sequencer missed trigger event</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SUTD</name>
              <description>Start-up time done</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TTO</name>
              <description>Timer time-out</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTS</name>
          <description>Resistive Touch Screen Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>SEQCFG</name>
          <description>Sequencer Configuration Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HWLA</name>
              <description>Half word left adjust</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIPOLAR</name>
              <description>Bipolar Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAIN</name>
              <description>Gain factor</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>GCOMP</name>
              <description>Gain Compensation</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>Trigger selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RES</name>
              <description>Resolution</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTERNAL</name>
              <description>Internal Voltage Source Selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MUXPOS</name>
              <description>MUX selection on Positive ADC input channel</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUXNEG</name>
              <description>MUX selection on Negative ADC input channel</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ZOOMRANGE</name>
              <description>Zoom shift/unipolar reference source selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CDMA_FIRST_DMA_WORD</name>
          <description>Configuration Direct Memory Access Register</description>
          <alternateRegister>CDMA</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>HWLA</name>
              <description>Half word left adjust</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BIPOLAR</name>
              <description>Bipolar Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STRIG</name>
              <description>Sequencer Trigger Event</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GAIN</name>
              <description>Gain factor</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GCOMP</name>
              <description>Gain Compensation</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ENSTUP</name>
              <description>Enable Start-Up Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RES</name>
              <description>Resolution</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TSS</name>
              <description>Internal timer start or stop bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTERNAL</name>
              <description>Internal Voltage Source Selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MUXPOS</name>
              <description>MUX selection on Positive ADC input channel</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MUXNEG</name>
              <description>MUX selection on Negative ADC input channel</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ZOOMRANGE</name>
              <description>Zoom shift/unipolar reference source selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DW</name>
              <description>Double Word transmitting</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDMA_SECOND_DMA_WORD</name>
          <description>Configuration Direct Memory Access Register</description>
          <alternateRegister>CDMA</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>LT</name>
              <description>Low Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WM</name>
              <description>Window Monitor Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>HT</name>
              <description>High Threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DW</name>
              <description>Double Word transmitting</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM</name>
          <description>Timing Configuration Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STARTUP</name>
              <description>Startup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>ENSTUP</name>
              <description>Enable Startup</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITIMER</name>
          <description>Internal Timer Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ITMC</name>
              <description>Internal timer max counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WCFG</name>
          <description>Window Monitor Configuration Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WM</name>
              <description>Window Monitor Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WTH</name>
          <description>Window Monitor Threshold Configuration Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LT</name>
              <description>Low threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>HT</name>
              <description>High Threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
