cmsis-svd/cmsis-svd/data/Microchip/ATSAM4LS.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HFLASHC</name>
      <version>1.1.0</version>
      <description>Flash Controller</description>
      <groupName>FLASHCALW</groupName>
      <prependToName>FLASHCALW_</prependToName>
      <baseAddress>0x400A0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>HFLASHC_INTREQ</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>FCR</name>
          <description>Flash Controller Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FRDY</name>
              <description>Flash Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FRDYSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Flash Ready does not generate an interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Flash Ready generates an interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKE</name>
              <description>Lock Error Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LOCKESelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Lock Error does not generate an interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Lock Error generates an interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROGE</name>
              <description>Programming Error Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PROGESelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Programming Error does not generate an interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Programming Error generates an interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FWS</name>
              <description>Flash Wait State</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FWSSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The flash is read with 0 wait states</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The flash is read with 1 wait states</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WS1OPT</name>
              <description>Wait State 1 Optimization</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCMD</name>
          <description>Flash Controller Command Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                <name>CMDSelect</name>
                <enumeratedValue>
                  <name>NOP</name>
                  <description>No Operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP</name>
                  <description>Write Page</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP</name>
                  <description>Erase Page</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPB</name>
                  <description>Clear Page Buffer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Lock Region containing page</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <description>Unlock Region containing page</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EA</name>
                  <description>Erase All, including secuity and fuse bits</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WGPB</name>
                  <description>Write General-Purpose fuse Bit</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EGPB</name>
                  <description>Erase General-Purpose fuse Bit</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSB</name>
                  <description>Set Security Bit</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGPFB</name>
                  <description>Program GPFuse Byte</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EAGPF</name>
                  <description>Erase All GP Fuses</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QPR</name>
                  <description>Quick Page Read</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WUP</name>
                  <description>Write User Page</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EUP</name>
                  <description>Erase User Page</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QPRUP</name>
                  <description>Quick Page Read User Page</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSEN</name>
                  <description>High Speed Mode Enable</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSDIS</name>
                  <description>High Speed Mode Disable</description>
                  <value>0x11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAGEN</name>
              <description>Page number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>KEY</name>
              <description>Write protection key</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>KEYSelect</name>
                <enumeratedValue>
                  <name>KEY</name>
                  <value>0xa5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FSR</name>
          <description>Flash Controller Status Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FRDY</name>
              <description>Flash Ready Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCKE</name>
              <description>Lock Error Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROGE</name>
              <description>Programming Error Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURITY</name>
              <description>Security Bit Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>QPRR</name>
              <description>Quick Page Read Result</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSMODE</name>
              <description>High Speed Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR</name>
              <description>ECC Error Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>ECCERRSelect</name>
                <enumeratedValue>
                  <name>NOERROR</name>
                  <description>no error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEECCERR</name>
                  <description>one ECC error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWOECCERR</name>
                  <description>two ECC errors detected</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK0</name>
              <description>Lock Region 0 Lock Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK1</name>
              <description>Lock Region 1 Lock Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK2</name>
              <description>Lock Region 2 Lock Status</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK3</name>
              <description>Lock Region 3 Lock Status</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK4</name>
              <description>Lock Region 4 Lock Status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK5</name>
              <description>Lock Region 5 Lock Status</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK6</name>
              <description>Lock Region 6 Lock Status</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK7</name>
              <description>Lock Region 7 Lock Status</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK8</name>
              <description>Lock Region 8 Lock Status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK9</name>
              <description>Lock Region 9 Lock Status</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK10</name>
              <description>Lock Region 10 Lock Status</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK11</name>
              <description>Lock Region 11 Lock Status</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK12</name>
              <description>Lock Region 12 Lock Status</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK13</name>
              <description>Lock Region 13 Lock Status</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK14</name>
              <description>Lock Region 14 Lock Status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK15</name>
              <description>Lock Region 15 Lock Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPR</name>
          <description>Flash Controller Parameter Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>FSZ</name>
              <description>Flash Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSZ</name>
              <description>Page Size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>Flash Controller Version Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000110</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
