cmsis-svd/cmsis-svd/data/Microchip/ATSAM4LS.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IISC</name>
      <version>1.0.0</version>
      <description>Inter-IC Sound (I2S) Controller</description>
      <groupName>IISC</groupName>
      <prependToName>IISC_</prependToName>
      <baseAddress>0x40004000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>IISC_INTREQ</name>
        <value>53</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXEN</name>
              <description>Receive Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RXENSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No effect</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Enables Data Receive if RXDIS is not set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDIS</name>
              <description>Receive Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RXDISSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No effect</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Disables Data Receive</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKEN</name>
              <description>Clocks Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CKENSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No effect</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Enables clocks if CKDIS is not set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKDIS</name>
              <description>Clocks Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CKDISSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No effect</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Disables clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEN</name>
              <description>Transmit Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TXENSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No effect</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Enables Data Transmit if TXDIS is not set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXDIS</name>
              <description>Transmit Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TXDISSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No effect</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Disables Data Transmit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SWRSTSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No effect</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Performs a software reset. Has priority on any other bit in CR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Master/Slave/Controller Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MODESelect</name>
                <enumeratedValue>
                  <name>SLAVE</name>
                  <description>Slave mode (only serial data handled, clocks received from external master or controller)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER</name>
                  <description>Master mode (clocks generated and output by IISC, serial data handled if CR.RXEN and/or CR.TXEN written to 1)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATALENGTH</name>
              <description>Data Word Length</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>DATALENGTHSelect</name>
                <enumeratedValue>
                  <name>32</name>
                  <description>32 bits</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>24 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>20 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>18 bits</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 bits</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16C</name>
                  <description>16 bits compact stereo</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 bits</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8C</name>
                  <description>8 bits compact stereo</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXMONO</name>
              <description>Receiver Mono</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RXMONOSelect</name>
                <enumeratedValue>
                  <name>STEREO</name>
                  <description>Normal mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONO</name>
                  <description>Left channel data is duplicated to right channel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDMA</name>
              <description>Single or Multiple DMA Channels for Receiver</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RXDMASelect</name>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single DMA channel</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTIPLE</name>
                  <description>One DMA channel per data channel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXLOOP</name>
              <description>Loop-back Test Mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RXLOOPSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Normal mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>ISDO internally connected to ISDI</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXMONO</name>
              <description>Transmitter Mono</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TXMONOSelect</name>
                <enumeratedValue>
                  <name>STEREO</name>
                  <description>Normal mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONO</name>
                  <description>Left channel data is duplicated to right channel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXDMA</name>
              <description>Single or Multiple DMA Channels for Transmitter</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TXDMASelect</name>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single DMA channel</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTIPLE</name>
                  <description>One DMA channel per data channel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXSAME</name>
              <description>Transmit Data when Underrun</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TXSAMESelect</name>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Zero data transmitted in case of underrun</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAME</name>
                  <description>Last data transmitted in case of underrun</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IMCKFS</name>
              <description>Master Clock to fs Ratio</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                <name>IMCKFSSelect</name>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 fs</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32 fs</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64 fs</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128 fs</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256 fs</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>384</name>
                  <description>384 fs</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <description>512 fs</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>768</name>
                  <description>768 fs</description>
                  <value>0x2f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <description>1024 fs</description>
                  <value>0x3f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IMCKMODE</name>
              <description>Master Clock Mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>IMCKMODESelect</name>
                <enumeratedValue>
                  <name>NO_IMCK</name>
                  <description>No IMCK generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMCK</name>
                  <description>IMCK generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IWS24</name>
              <description>IWS Data Slot Width</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>IWS24Select</name>
                <enumeratedValue>
                  <name>32</name>
                  <description>IWS Data Slot is 32-bit wide for DATALENGTH=18/20/24-bit</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>IWS Data Slot is 24-bit wide for DATALENGTH=18/20/24-bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
