cmsis-svd/cmsis-svd/data/Microchip/ATSAM4LS.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PICOUART</name>
      <version>1.0.1</version>
      <description>Pico UART</description>
      <groupName>PICOUART</groupName>
      <prependToName>PICOUART_</prependToName>
      <baseAddress>0x400F1400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIS</name>
              <description>Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Configuration Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>Source Enable Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ACTION</name>
              <description>Action to perform</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MATCH</name>
              <description>Data Match</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable Interrupt Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DRDY</name>
              <description>Data Ready Interrupt Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RHR</name>
          <description>Receive Holding Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CDATA</name>
              <description>Received Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>Version Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000101</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PM</name>
      <version>4.4.1</version>
      <description>Power Manager</description>
      <groupName>PM</groupName>
      <prependToName>PM_</prependToName>
      <baseAddress>0x400E0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PM_INTREQ</name>
        <value>22</value>
      </interrupt>
      <registers>
        <register>
          <name>MCCTRL</name>
          <description>Main Clock Control</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MCSEL</name>
              <description>Main Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUSEL</name>
          <description>CPU Clock Select</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPUSEL</name>
              <description>CPU Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CPUSELSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>fCPU:fmain. CPUDIV:</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>fCPU:fmain / 2^(CPUSEL+1)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPUDIV</name>
              <description>CPU Division</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBASEL</name>
          <description>PBA Clock Select</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PBSEL</name>
              <description>PBA Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PBDIV</name>
              <description>PBA Division Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBBSEL</name>
          <description>PBB Clock Select</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PBSEL</name>
              <description>PBB Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PBDIV</name>
              <description>PBB Division Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBCSEL</name>
          <description>PBC Clock Select</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PBSEL</name>
              <description>PBC Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PBDIV</name>
              <description>PBC Division Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBDSEL</name>
          <description>PBD Clock Select</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PBSEL</name>
              <description>PBD Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PBDIV</name>
              <description>PBD Division Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUMASK</name>
          <description>CPU Mask</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>OCD</name>
              <description>OCD CPU Clock Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSBMASK</name>
          <description>HSB Mask</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <resetValue>0x000001E2</resetValue>
          <fields>
            <field>
              <name>PDCA_</name>
              <description>PDCA HSB Clock Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HFLASHC_</name>
              <description>HFLASHC HSB Clock Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HRAMC1_</name>
              <description>HRAMC1 HSB Clock Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBC_</name>
              <description>USBC HSB Clock Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCCU_</name>
              <description>CRCCU HSB Clock Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTOP0_</name>
              <description>HTOP0 HSB Clock Mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTOP1_</name>
              <description>HTOP1 HSB Clock Mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTOP2_</name>
              <description>HTOP2 HSB Clock Mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTOP3_</name>
              <description>HTOP3 HSB Clock Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBAMASK</name>
          <description>PBA Mask</description>
          <addressOffset>0x028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IISC_</name>
              <description>IISC APB Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI_</name>
              <description>SPI APB Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC0_</name>
              <description>TC0 APB Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC1_</name>
              <description>TC1 APB Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIM0_</name>
              <description>TWIM0 APB Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIS0_</name>
              <description>TWIS0 APB Clock Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIM1_</name>
              <description>TWIM1 APB Clock Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIS1_</name>
              <description>TWIS1 APB Clock Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART0_</name>
              <description>USART0 APB Clock Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1_</name>
              <description>USART1 APB Clock Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART2_</name>
              <description>USART2 APB Clock Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART3_</name>
              <description>USART3 APB Clock Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCIFE_</name>
              <description>ADCIFE APB Clock Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DACC_</name>
              <description>DACC APB Clock Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACIFC_</name>
              <description>ACIFC APB Clock Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GLOC_</name>
              <description>GLOC APB Clock Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABDACB_</name>
              <description>ABDACB APB Clock Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRNG_</name>
              <description>TRNG APB Clock Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PARC_</name>
              <description>PARC APB Clock Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CATB_</name>
              <description>CATB APB Clock Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIM2_</name>
              <description>TWIM2 APB Clock Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIM3_</name>
              <description>TWIM3 APB Clock Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBBMASK</name>
          <description>PBB Mask</description>
          <addressOffset>0x02C</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>HFLASHC_</name>
              <description>HFLASHC APB Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HCACHE_</name>
              <description>HCACHE APB Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HMATRIX_</name>
              <description>HMATRIX APB Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDCA_</name>
              <description>PDCA APB Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCCU_</name>
              <description>CRCCU APB Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBC_</name>
              <description>USBC APB Clock Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEVC_</name>
              <description>PEVC APB Clock Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBCMASK</name>
          <description>PBC Mask</description>
          <addressOffset>0x030</addressOffset>
          <size>32</size>
          <resetValue>0x0000001F</resetValue>
          <fields>
            <field>
              <name>PM_</name>
              <description>PM APB Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHIPID_</name>
              <description>CHIPID APB Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCIF_</name>
              <description>SCIF APB Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FREQM_</name>
              <description>FREQM APB Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIO_</name>
              <description>GPIO APB Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBDMASK</name>
          <description>PBD Mask</description>
          <addressOffset>0x034</addressOffset>
          <size>32</size>
          <resetValue>0x0000003F</resetValue>
          <fields>
            <field>
              <name>BPM_</name>
              <description>BPM APB Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSCIF_</name>
              <description>BSCIF APB Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AST_</name>
              <description>AST APB Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDT_</name>
              <description>WDT APB Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EIC_</name>
              <description>EIC APB Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PICOUART_</name>
              <description>PICOUART APB Clock Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBADIVMASK</name>
          <description>PBA Divided Clock Mask</description>
          <addressOffset>0x040</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>CFDCTRL</name>
          <description>Clock Failure Detector Control</description>
          <addressOffset>0x054</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CFDEN</name>
              <description>Clock Failure Detection Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFV</name>
              <description>Store Final Value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UNLOCK</name>
          <description>Unlock Register</description>
          <addressOffset>0x058</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Unlock Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>KEY</name>
              <description>Unlock Key</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
