cmsis-svd/cmsis-svd/data/Microchip/ATSAM4LS.svd
        <register>
          <dim>3</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>IMR%s</name>
          <description>Interrupt Mask Register Channel</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>COVFSSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The Counter Overflow Interrupt is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The Counter Overflow Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LOVRSSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The Load Overrun Interrupt is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The Load Overrun Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CPASSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The RA Compare Interrupt is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The RA Compare Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CPBSSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The RB Compare Interrupt is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The RB Compare Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CPCSSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The RC Compare Interrupt is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The RC Compare Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LDRASSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The Load RA Interrupt is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The Load RA Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LDRBSSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The Load RB Interrupt is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The Load RB Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ETRGSSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The External Trigger Interrupt is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The External Trigger Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BCR</name>
          <description>TC Block Control Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SYNC</name>
              <description>Synchro Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SYNCSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>No effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Asserts the SYNC signal which generates a software trigger simultaneously for each of the channels.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BMR</name>
          <description>TC Block Mode Register</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TC0XC0S</name>
              <description>External Clock Signal 0 Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TC0XC0SSelect</name>
                <enumeratedValue>
                  <name>TCLK0</name>
                  <description>Select TCLK0 as clock signal 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CLK</name>
                  <description>Select no clock as clock signal 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA1</name>
                  <description>Select TIOA1 as clock signal 0.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA2</name>
                  <description>Select TIOA2 as clock signal 0.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TC1XC1S</name>
              <description>External Clock Signal 1 Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TC1XC1SSelect</name>
                <enumeratedValue>
                  <name>TCLK1</name>
                  <description>Select TCLK1 as clock signal 1.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CLK</name>
                  <description>Select no clock as clock signal 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA0</name>
                  <description>Select TIOA0 as clock signal 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA2</name>
                  <description>Select TIOA2 as clock signal 1.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TC2XC2S</name>
              <description>External Clock Signal 2 Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TC2XC2SSelect</name>
                <enumeratedValue>
                  <name>TCLK2</name>
                  <description>Select TCLK2 as clock signal 2.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CLK</name>
                  <description>Select no clock as clock signal 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA0</name>
                  <description>Select TIOA0 as clock signal 2.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA1</name>
                  <description>Select TIOA1 as clock signal 2.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WPMR</name>
          <description>Write Protect Mode Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protect Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protect Key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FEATURES</name>
          <description>Features Register</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CTRSIZE</name>
              <description>Counter Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>UPDNIMPL</name>
              <description>Up Down is Implemented</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRPBHSB</name>
              <description>Bridge Type is PB to HSB</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>Version Register</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000402</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Reserved. Value subject to change. No functionality associated. This is the Atmel internal version of the macrocell.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Reserved.  Value subject to change.  No functionality associated.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
